Request/Validation off, MTOM on/consoleLog.txt

Jun 12, 2014 5:15:29 PM org.apache.cxf.services.pageService.pageServicePort.pageServicePortType
INFO: Inbound Message
----------------------------
ID: 4
Address: http://localhost:8080/PaperTest3/services/pageServicePort
Encoding: ISO-8859-1
Http-Method: POST
Content-Type: multipart/related; type="application/xop+xml"; start="<rootpart@soapui.org>"; start-info="text/xml"; boundary="----=_Part_4_14204266.1402560929577"
Headers: {accept-encoding=[gzip,deflate], connection=[Keep-Alive], Content-Length=[926], content-type=[multipart/related; type="application/xop+xml"; start="<rootpart@soapui.org>"; start-info="text/xml"; boundary="----=_Part_4_14204266.1402560929577"], host=[localhost:8080], mime-version=[1.0], SOAPAction=["Ping"], user-agent=[Apache-HttpClient/4.1.1 (java 1.5)]}
Payload: 
------=_Part_4_14204266.1402560929577
Content-Type: application/xop+xml; charset=UTF-8; type="text/xml"
Content-Transfer-Encoding: 8bit
Content-ID: <rootpart@soapui.org>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:page="http://paper.bitapp.de/page">
   <soapenv:Header/>
   <soapenv:Body>
      <page:Ping>
         <Status>
            <FileName>Cool</FileName>
            <BinaryData><inc:Include href="cid:TestFile.txt" xmlns:inc="http://www.w3.org/2004/08/xop/include"/></BinaryData>
         </Status>
      </page:Ping>
   </soapenv:Body>
</soapenv:Envelope>
------=_Part_4_14204266.1402560929577
Content-Type: text/plain; charset=us-ascii; name=TestFile.txt
Content-Transfer-Encoding: 7bit
Content-ID: <TestFile.txt>
Content-Disposition: attachment; name="TestFile.txt"; filename="TestFile.txt"

This is the test data file
------=_Part_4_14204266.1402560929577--

--------------------------------------
de.bitapp.paper.page.FileType@6eca6c5d
Jun 12, 2014 5:15:29 PM de.bitapp.paper.page.PageServicePortTypeImpl ping
INFO: Executing operation ping
Jun 12, 2014 5:15:29 PM org.apache.cxf.services.pageService.pageServicePort.pageServicePortType
INFO: Outbound Message
---------------------------
ID: 4
Response-Code: 200
Encoding: UTF-8
Content-Type: text/xml
Headers: {}
Payload: <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns1:PingResponse xmlns:ns1="http://paper.bitapp.de/page"><Status><Code>1048498287</Code><Message>Message-2025488042</Message></Status></ns1:PingResponse></soap:Body></soap:Envelope>
--------------------------------------
